// © Copyright 2004-2010, 2015 HP Development Company, L.P.

TaskName = "Aggiorna firmware";

// Errors
FileOpenError = "Impossibile aprire il file %@";
FileOpenErrorExplanation = "Il file è corrotto oppure è stato spostato in un'altra ubicazione, rinominato o eliminato. Verificare l'ubicazione del file oppure selezionare un altro file e riprovare.";
PrintChannelOpenError = "Impossibile aprire un canale della stampante";
PrintChannelOpenErrorExplanation = "Verificare che la stampante sia accesa e la connessione stabilita, quindi riprovare.";
SendDataError = "Impossibile inviare i dati alla stampante";
SendDataErrorExplanation = "Verificare che la stampante sia accesa e la connessione stabilita, quindi riprovare.";

SomePenErrorTitle = "Impossibile aggiornare il firmware";
DoorOpenMsg = "Impossibile aggiornare il firmware perché uno dei coperchi è aperto. Chiudere tutti i coperchi della stampante.";

// Aquamarine Errors
FileCheckError = "Impossibile aggiornare il firmware";
FileCheckErrorExplanation = "Pacchetto firmware non valido. Selezionare un altro file e provare di nuovo.";

OkButton = "Ok";
CancelButton = "Annulla";
FirmwareUpdateTitle = "Aggiornamento firmware";
FirmwareUpdateDeviceState = "Stampa in corso";
FirmwareUpdateCancelingDeviceState = "Annullamento in corso";

// Great Wall Messages
PrinterIdleWarning = "L’aggiornamento del firmware potrebbe non riuscire se la stampante è occupata (ad esempio, se sta stampando un documento o è in fase di calibrazione).\n\nControllare che la stampante sia inattiva prima di procedere all'aggiornamento del firmware.";
UpdateSuccessful = "Il caricamento del file del firmware è riuscito e la stampante sta per essere aggiornata.\n\nAl termine dell’aggiornamento del firmware, la stampante viene riavviata automaticamente.";
InvalidPackage = "Si sono verificati dei problemi nel file del firmware e la procedura di aggiornamento del firmware non è riuscita. Il problema potrebbe essere stato causato da un errore di trasmissione.\n\nRiprovare la procedura di aggiornamento del firmware.\nSe il problema persiste, rivolgersi all’assistenza clienti HP.";
FailedDependencies = "La procedura di aggiornamento del firmware non è riuscita a causa di un problema di dipendenze.\n\nLa corrente versione del firmware è %@, e si sta cercando di installare %@.\n\nVisitare la seguente pagina Web per trovare il pacchetto di aggiornamento adatto per questa stampante:\n%@.";
NotNow = "L’aggiornamento del firmware non è riuscito perché la stampante è occupata (ad esempio, sta elaborando o stampando un documento).\n\nControllare che la stampante sia inattiva prima di riprovare l'aggiornamento del firmware.";
TransmissionError = "L’aggiornamento del firmware non è riuscito a causa di problemi di trasmissione.\n\nVerificare la connessione della stampante e riprovare l’aggiornamento del firmware.";
LicenseNotAccepted = "L’aggiornamento del firmware non è riuscito perché la licenza non è stata accettata.";
FatalError = "Alcuni problemi hanno impedito il riuscito aggiornamento del firmware.\nSe il problema persiste, rivolgersi all’assistenza clienti HP.";

// layout
TaskTitle = "Aggiorna firmware";
TaskDescription = "Selezionare un file contenente un aggiornamento firmware e trasferirlo alla stampante per aggiornarlo.";
FileNameTitle = "Nome del file:";
FileNameField = "<Non selezionato>";
ChooseButton = "Scegli…";
UpdateButton = "Aggiorna";
ProgressPanel = "Aggiornamento del progresso";
FirmwareUpdateProcessTitle = "Aggiornamento…";
